//---------------------------------------------------------------------------
//!	@file	Camera.cpp
//! @brief	ゲームカメラ
//---------------------------------------------------------------------------
#include "Camera.h"
#include <System/Component/ComponentCollisionModel.h>
#include <System/Component/ComponentSpringArm.h>

//---------------------------------------------------------------------------------
//!	初期化
//---------------------------------------------------------------------------------
bool Camera::Init()
{
    __super::Init();

    auto com_comp = AddComponent<ComponentCamera>();
    com_comp->SetPositionAndTarget({0, 50, -50}, {0, 0, 0});

    // カメラオブジェクトを移動(カメラの位置、注視点も一緒に移動します)
    //auto arm = AddComponent<ComponentSpringArm>();	  // スプリングアームを追加
    auto com_comp = AddComponent<ComponentCamera>();
    com_comp->SetPositionAndTarget({0.0f, 20.0f, -50.0f}, {0.0f, 10.0f, 0.0f});

    SetName(u8"カメラ");
    return true;
}

//---------------------------------------------------------------------------------
//!	更新
//---------------------------------------------------------------------------------
void Camera::Update()
{
    __super::Update();
}

//---------------------------------------------------------------------------------
//!	描画
//---------------------------------------------------------------------------------
void Camera::Draw()
{
    __super::Draw();
}

//---------------------------------------------------------------------------------
//!	終了
//---------------------------------------------------------------------------------
void Camera::Exit()
{
    __super::Exit();
}

//!GUI表示
void Camera::GUI()
{
    __super::GUI();
}
