//---------------------------------------------------------------------------
//!	@file	GameMain.cpp
//! @brief	ゲームメイン
//---------------------------------------------------------------------------
#include "Camera.h"
#include <System/Component/ComponentCamera.h>
#include <System/Component/ComponentSpringArm.h>

//---------------------------------------------------------------------------------
//!	初期化
//---------------------------------------------------------------------------------
bool Camera::Init()
{
    __super::Init();
    auto com_comp = AddComponent<ComponentCamera>();
    com_comp->SetPositionAndTarget({0, 5, -50}, {0, 0, 0});
    // カメラオブジェクトを移動(カメラの位置、注視点も一緒に移動します)
    SetTranslate({30, 0, 0});
    auto arm = AddComponent<ComponentSpringArm>();    // スプリングアームを追加
    SetName(u8"カメラ");
    return true;
}

//---------------------------------------------------------------------------------
//!	更新
//---------------------------------------------------------------------------------
void Camera::Update()
{
    __super::Update();
}

//---------------------------------------------------------------------------------
//!	描画
//---------------------------------------------------------------------------------
void Camera::Draw()
{
    __super::Draw();
}

//---------------------------------------------------------------------------------
//!	終了
//---------------------------------------------------------------------------------
void Camera::Exit()
{
    __super::Exit();
}

//!GUI表示
void Camera::GUI()
{
    __super::GUI();
}
