//---------------------------------------------------------------------------
//!	@file	ResultInfo.h
//! @brief	結果に必要なデータの構造体
//! @author 山﨑愛
//---------------------------------------------------------------------------
#pragma once
#include <System/Graphics/Model.h>
//---------------------------------------------------------------------------
//! @struct ResultInfo
//! @brief 結果に必要なデータの構造体
//---------------------------------------------------------------------------
struct ResultInfo
{
    int   rank_;          // 順位
    Model model_data_;    // モデルデータ
};
