//---------------------------------------------------------------------------
//!	@file	UIImage.cpp
//! @brief	UIの画像オブジェクト
//! @author	山﨑愛
//---------------------------------------------------------------------------
#include "UIImage.h"
#include <System/UIComponent/ComponentImage.h>
#include <Game/system/ImageBuffer.h>

//---------------------------------------------------------------------------------
//!	初期化
//---------------------------------------------------------------------------------
bool UIImage::Init()
{
    __super::Init();
    //---------------------------------------------------------------------------------
    //	画像機能コンポーネントの追加
    //---------------------------------------------------------------------------------
    auto img_comp = AddComponent<ComponentImage>();    // 画像機能コンポーネントを追加
    //デフォルト画像を設定
    img_comp->SetImage(ImageBuffer::GetImageHandle("deff"));    // 画像コンポーネントに画像を設定
    image_component_ = img_comp;                                // weak_ptrとして保持
    return true;
}

//---------------------------------------------------------------------------------
//!	更新
//---------------------------------------------------------------------------------
void UIImage::Update()
{
    __super::Update();
}

//---------------------------------------------------------------------------------
//!	描画
//---------------------------------------------------------------------------------
void UIImage::Draw()
{
    __super::Draw();
}

//---------------------------------------------------------------------------------
//!	終了
//---------------------------------------------------------------------------------
void UIImage::Exit()
{
    __super::Exit();
}

//!GUI表示
void UIImage::GUI()
{
    __super::GUI();
}

//---------------------------------------------------------------------------
//! @brief	画像の設定
//---------------------------------------------------------------------------
std::shared_ptr<UIImage> UIImage::SetImage(int image)
{
    if(auto image_comp = image_component_.lock()) {
        image_comp->SetImage(image);    // 画像コンポーネントに画像を設定
    }
    return dynamic_pointer_cast<UIImage>(shared_from_this());
}

//---------------------------------------------------------------------------
//画像ハンドルの取得
//---------------------------------------------------------------------------
int UIImage::GetImageHandle()
{
    if(auto image_comp = image_component_.lock()) {
        return image_comp->GetImageHandle();    // 画像コンポーネントから画像ハンドルを取得
    }
    return -1;
}
