//---------------------------------------------------------------------------
//!	@file	UIObject.cpp
//! @brief	UIオブジェクトのベースクラス
//! @author	山﨑愛
//---------------------------------------------------------------------------
#include "UIObject.h"
#include <System/UIComponent/ComponentTransformUI.h>

//---------------------------------------------------------------------------------
//!	初期化
//---------------------------------------------------------------------------------
bool UIObject::Init()
{
    __super::Init();
    //---------------------------------------------------------------------------------
    //	UI基本機能コンポーネントの追加
    //---------------------------------------------------------------------------------
    auto ui_transform_comp  = AddComponent<ComponentTransformUI>();    // 文字列機能コンポーネントを追加
    ui_transform_component_ = ui_transform_comp;                       // weak_ptrとして保持
    return true;
}

//---------------------------------------------------------------------------------
//!	更新
//---------------------------------------------------------------------------------
void UIObject::Update()
{
    __super::Update();
}

//---------------------------------------------------------------------------------
//!	描画
//---------------------------------------------------------------------------------
void UIObject::Draw()
{
    __super::Draw();
}

//---------------------------------------------------------------------------------
//!	終了
//---------------------------------------------------------------------------------
void UIObject::Exit()
{
    __super::Exit();
}

//---------------------------------------------------------------------------------
//!	GUI表示
//---------------------------------------------------------------------------------
void UIObject::GUI()
{
    __super::GUI();
}

//---------------------------------------------------------------------------------
//!	描画位置の設定
//---------------------------------------------------------------------------------
std::shared_ptr<ComponentTransformUI> UIObject::SetAlignment(ComponentTransformUI::Alignment alignment)
{
    if(auto ui_transform_comp = ui_transform_component_.lock()) {
        ui_transform_comp->SetAlignment(alignment);    // UIの配置位置を設定
        return std::dynamic_pointer_cast<ComponentTransformUI>(ui_transform_comp);
    }
    return nullptr;    // 失敗した場合はnullptrを返す
}
