//--------------------------------------------------------------------
//! @file	ComponentJump.h
//! @brief	ジャンプ機能コンポーネントの定義
//! @author 山﨑愛
//--------------------------------------------------------------------
#pragma once
#include <System/Scene.h>
#include <System/Component/Component.h>

USING_PTR(ComponentJump);

//! @brief ジャンプ機能コンポーネント
class ComponentJump : public Component
{
public:
    BP_COMPONENT_DECL(ComponentJump, u8"ジャンプ機能コンポーネント");
    //! @{
    //--------------------------------------------------------------------
    // 初期化処理
    //--------------------------------------------------------------------
    void Init() override;

    //--------------------------------------------------------------------
    // ImGui
    //--------------------------------------------------------------------
    void GUI() override;

    //--------------------------------------------------------------------
    // ジャンプ時の衝撃をセット
    //! @param value [in] y座標に飛び上がる高さ
    //--------------------------------------------------------------------
    void SetJumpImpulse(float value);

    //--------------------------------------------------------------------
    //	有効無効をセット
    //! @param enable_flag [in] ジャンプが有効か無効か
    //--------------------------------------------------------------------
    void SetEnable(bool enable_flag = true);

    //--------------------------------------------------------------------
    // ジャンプをしているかを返す関数
    //! @return ジャンプ中ならtrue、そうでなければfalse
    //--------------------------------------------------------------------
    bool IsJumping();

    //--------------------------------------------------------------------
    //	外部からジャンプ条件を入れるための関数
    //! @param condition [in] 条件
    //! @attention これを設定しないと絶対にジャンプしないので注意
    //--------------------------------------------------------------------
    void SetConditionsJump(std::function<bool()> condition);

    //--------------------------------------------------------------------
    // ジャンプしたフレームであることを返す関数
    //! @return ジャンプしたフレームならtrue、そうでなければfalse
    //--------------------------------------------------------------------
    bool IsJumpFrame();
    //! @}

private:
    //--------------------------------------------------------------------
    // ジャンプ可能かを判定する関数
    //! @return ジャンプ可能ならtrue、そうでなければfalse
    //--------------------------------------------------------------------
    bool CanJump();

private:
    std::function<bool()> conditions_jump_     = []() { return false; };    //ジャンプ条件
    float                 jump_force_          = 15.0f;                     //ジャンプで足す値
    bool                  set_enable_          = true;                      //ジャンプをできるかどうかの変数
    bool                  is_jumping_          = false;                     //ジャンプをしているかの変数
    bool                  is_jump_frame_       = false;                     //ジャンプしたフレームかどうか
    int                   impulse_frame_count_ = -1;                        //実際にimpulseを加えるフレームを図る変数
    const int             IMPULSE_FRAME_       = 5;                         //impulseを加えるフレーム数

    //--------------------------------------------------------------------
    //! @name Cereal処理
    //--------------------------------------------------------------------
    //@{

    //! @brief セーブ
    // @param arc アーカイバ
    // @param ver バージョン
    CEREAL_SAVELOAD(arc, ver) { arc(cereal::make_nvp("Component", cereal::base_class<Component>(this))); }
};

CEREAL_CLASS_VERSION(ComponentJump, 3);
