//---------------------------------------------------------------------------
//!	@file	ComponentHp.cpp
//! @brief	HP機能コンポーネント
//! @auther 山﨑愛
//---------------------------------------------------------------------------
#pragma once
#include <System/Component/ComponentHp.h>

//---------------------------------------------------------------------------
//! @brief	初期化処理
//---------------------------------------------------------------------------
void ComponentHp::Init()
{
    __super::Init();
}

//---------------------------------------------------------------------------
//! @brief	更新処理
//---------------------------------------------------------------------------
void ComponentHp::Update()
{
    __super::Update();
}

//---------------------------------------------------------------------------
//! @brief	ImGui
//---------------------------------------------------------------------------
void ComponentHp::GUI()
{
    __super::GUI();

    // GUI内に出現させる
    ImGui::Begin(GetOwner()->GetName().data());
    {
        ImGui::Separator();
        if(ImGui::TreeNode(u8"Hp")) {
            // GUI上でオーナーから自分(SampleObjectController)を削除します
            if(ImGui::Button(u8"削除"))
                GetOwner()->RemoveComponent(shared_from_this());

            ImGui::TreePop();
        }
    }
    ImGui::End();
}

//---------------------------------------------------------------------------
//! @brief	HPのゲッタ
//---------------------------------------------------------------------------
int ComponentHp::GetHitPoints() const
{
    return hp_;
}

//---------------------------------------------------------------------------
//! @brief	HPのセッタ
//---------------------------------------------------------------------------

void ComponentHp::SetHitPoints(int hp)
{
    hp_ = hp;
}

//---------------------------------------------------------------------------
//! @brief	ダメージを受ける関数
//---------------------------------------------------------------------------
void ComponentHp::TakeDamage(int damage)
{
    hp_ -= damage;
}
CEREAL_REGISTER_TYPE(ComponentHp)
CEREAL_REGISTER_POLYMORPHIC_RELATION(Component, ComponentHp)
