//---------------------------------------------------------------------------
//!	@file	StateKnockback.cpp
//! @brief	ノックバック状態コンポーネントの定義
//! @author 山﨑愛
//---------------------------------------------------------------------------
#pragma once
#include <System/Scene.h>
#include "StateBase.h"

USING_PTR(StateKnockback);

//---------------------------------------------------------------------------
//! @class ノックバック状態コンポーネント
//! @brief ノックバック状態を管理するコンポーネント
//---------------------------------------------------------------------------
class StateKnockback : public StateBase
{
public:
    BP_COMPONENT_DECL(StateKnockback, u8"StateKnockback");
    //---------------------------------------------------------------------------
    // 初期化処理
    //! @note 更新処理の登録もここで行う
    //---------------------------------------------------------------------------
    void Init() override;

    //---------------------------------------------------------------------------
    // GUI表示
    //---------------------------------------------------------------------------
    void GUI() override;

private:
    //--------------------------------------------------------------------
    //! @name Cereal処理
    //--------------------------------------------------------------------
    //@{

    //! @brief セーブ
    // @param arc アーカイバ
    // @param ver バージョン
    CEREAL_SAVELOAD(arc, ver) { arc(cereal::make_nvp("Component", cereal::base_class<Component>(this))); }
};

CEREAL_CLASS_VERSION(StateKnockback, 1);
