//---------------------------------------------------------------------------
//!	@file	GameRepository.h
//! @brief	ゲーム情報を管理するリポジトリクラス
//! @note   シングルトンパターンで実装
//! @author 山﨑愛
//---------------------------------------------------------------------------
#pragma once
#include <array>
#include <Game/Scene/info/ResultInfo.h>

class GameRepository
{
private:
    //---------------------------------------------------------------------------
    // コンストラクタ
    //! @note シングルトンパターンのためprivateにする
    //---------------------------------------------------------------------------
    GameRepository();

    // コピーを禁止する
    GameRepository(const GameRepository&)            = delete;
    GameRepository& operator=(const GameRepository&) = delete;

public:
    //---------------------------------------------------------------------------
    // GameRepositoryのインスタンスを取得する静的メソッド
    //! @return GameRepositoryのインスタンス
    //---------------------------------------------------------------------------
    static GameRepository& Instance();

    //---------------------------------------------------------------------------
    // キャラクター名を設定するメソッド
    //! @param[in] chara_name キャラクター名
    //---------------------------------------------------------------------------
    void SetSelectedCharacterName(const std::string& chara_name);

    //---------------------------------------------------------------------------
    // 選択されたキャラクター名を取得するメソッド
    //! @return 選択されたキャラクター名
    //---------------------------------------------------------------------------
    std::string GetSelectedCharacterName() const;

    //---------------------------------------------------------------------------
    //スキル名を設定するメソッド
    //! @param[in] skill_name スキル名
    //---------------------------------------------------------------------------
    void SetSelectedSkillName(const std::string& skill_name);

    //---------------------------------------------------------------------------
    // 選択されたスキル名を取得するメソッド
    //! @return 選択されたスキル名
    //---------------------------------------------------------------------------
    std::string GetSelectedSkillName() const;

    //---------------------------------------------------------------------------
    // 結果を設定するメソッド
    //! @param [in] result_datas 各キャラクターの名前と順位
    //---------------------------------------------------------------------------
    void SetResultDatas(const std::array<ResultInfo, 4>& result_datas);

    //---------------------------------------------------------------------------
    // 結果を取得するメソッド
    //! @return 各キャラクターの名前と順位
    //---------------------------------------------------------------------------
    const std::array<ResultInfo, 4>& GetResultDatas() const;

    //---------------------------------------------------------------------------
    // ゲームリポジトリをクリア(リセット)するメソッド
    //---------------------------------------------------------------------------
    void Clear();

private:
    std::string               selected_character_name_;    //!< 選択されたキャラクター名(Factoryで必要)
    std::array<ResultInfo, 4> rsult_datas_;                //!< 各キャラクターのモデルと順位(プレイヤー -> NPC1 -> NPC2 -> NPC3)
    std::string               selected_skill_name_;        //!< 選択されたスキル名(Factoryで必要)
};
