//---------------------------------------------------------------------------
//!	@file	GameRepository.h
//! @brief	ゲーム情報を管理するリポジトリクラス
//! @note   シングルトンパターンで実装
//! @author 山﨑愛
//---------------------------------------------------------------------------
#pragma once

class GameRepository
{
private:
    //---------------------------------------------------------------------------
    // コンストラクタ
    //! @note シングルトンパターンのためprivateにする
    //---------------------------------------------------------------------------
    GameRepository();

    // コピーを禁止する
    GameRepository(const GameRepository&)            = delete;
    GameRepository& operator=(const GameRepository&) = delete;

public:
    //---------------------------------------------------------------------------
    // GameRepositoryのインスタンスを取得する静的メソッド
    //! @return GameRepositoryのインスタンス
    //---------------------------------------------------------------------------
    static GameRepository& Instance();

    //---------------------------------------------------------------------------
    // キャラクター名を設定するメソッド
    //! @param[in] chara_name キャラクター名
    //---------------------------------------------------------------------------
    void SetSelectedCharacterName(const std::string& chara_name);

    //---------------------------------------------------------------------------
    // 選択されたキャラクター名を取得するメソッド
    //! @return 選択されたキャラクター名
    //---------------------------------------------------------------------------
    std::string GetSelectedCharacterName() const;

private:
    std::string selected_character_name;    //!< 選択されたキャラクター名(Factoryで必要)
};
