//---------------------------------------------------------------------------
//!	@file	GameRepository.h
//! @brief	ゲーム情報を管理するリポジトリクラス
//! @author 山﨑愛
//---------------------------------------------------------------------------
#include "GameRepository.h"

//---------------------------------------------------------------------------
//! @brief コンストラクタ
//---------------------------------------------------------------------------
GameRepository::GameRepository()
{
}

//---------------------------------------------------------------------------
//! @brief GameRepositoryのインスタンスを取得する静的メソッド
//---------------------------------------------------------------------------
GameRepository& GameRepository::Instance()
{
    static GameRepository instance;    // ここで一度だけ生成
    return instance;
}

//---------------------------------------------------------------------------
//! @brief キャラクター名を設定するメソッド
//---------------------------------------------------------------------------
void GameRepository::SetSelectedCharacterName(const std::string& chara_name)
{
    selected_character_name = chara_name;
}

//---------------------------------------------------------------------------
//! @brief 選択されたキャラクター名を取得するメソッド
//---------------------------------------------------------------------------
std::string GameRepository::GetSelectedCharacterName() const
{
    return selected_character_name;
}

//---------------------------------------------------------------------------
//! @brief 結果を設定するメソッド
//---------------------------------------------------------------------------
void GameRepository::SetResultDatas(const std::array<ResultInfo, 4>& result_datas)
{
    rsult_datas_ = result_datas;
}

//---------------------------------------------------------------------------
//! @brief 結果を取得するメソッド
//---------------------------------------------------------------------------
const std::array<ResultInfo, 4>& GameRepository::GetResultDatas() const
{
    return rsult_datas_;
}

//---------------------------------------------------------------------------
//! @brief ゲームリポジトリをクリア(リセット)するメソッド
//---------------------------------------------------------------------------
void GameRepository::Clear()
{
    selected_character_name = "";
    rsult_datas_            = {};
}
