//---------------------------------------------------------------------------
//!	@file	GameRepository.h
//! @brief	ゲーム情報を管理するリポジトリクラス
//! @author 山﨑愛
//---------------------------------------------------------------------------
#include "GameRepository.h"

//---------------------------------------------------------------------------
//! @brief コンストラクタ
//---------------------------------------------------------------------------
GameRepository::GameRepository()
{
}

//---------------------------------------------------------------------------
//! @brief GameRepositoryのインスタンスを取得する静的メソッド
//---------------------------------------------------------------------------
GameRepository& GameRepository::Instance()
{
    static GameRepository instance;    // ここで一度だけ生成
    return instance;
}

//---------------------------------------------------------------------------
//! @brief キャラクター名を設定するメソッド
//---------------------------------------------------------------------------
void GameRepository::SetSelectedCharacterName(const std::string& chara_name)
{
    selected_character_name = chara_name;
}

//---------------------------------------------------------------------------
//! @brief 選択されたキャラクター名を取得するメソッド
//---------------------------------------------------------------------------
std::string GameRepository::GetSelectedCharacterName() const
{
    return selected_character_name;
}
