//---------------------------------------------------------------------------
//!	@file	HlslppUseful.cpp
//! @brief	Hlslppの拡張
//! @author 山﨑愛
//---------------------------------------------------------------------------
#pragma once
#include <System/Scene.h>
//---------------------------------------------------------------------------
//	マウス座標を float2 で取得
//! @retval マウスのスクリーン座標
//---------------------------------------------------------------------------
float2 GetMouseFloat2();
//---------------------------------------------------------------------------
//	2Dの四角同士の当たり判定（座標と大きさに Float2 を渡すバージョン）
//---------------------------------------------------------------------------
bool CheckBoxCenterHit(const float2& box_pos1, const float2& box_size1, const float2& box_pos2, const float2& box_size2);
//---------------------------------------------------------------------------
//	2Dの四角と点の当たり判定（座標と大きさに Float2 を渡すバージョン）
//---------------------------------------------------------------------------
bool CheckBoxPointHit(const float2& box_pos, const float2& box_size, const float2& point);
//---------------------------------------------------------------------------
// 円形に配置した座標を返す関数
//! @params center 円の中心座標
//! @params radius 円の半径
//! @params divisions 円周上の分割数
//! @params index 取得したい点のインデックス（0からdivisions-1まで）
//---------------------------------------------------------------------------
float3 GetPointOnCircle(const float3& center, float radius, int divisions, int index);
