//---------------------------------------------------------------------------
//!	@file	ImageBuffer.h
//! @brief	画像のバッファクラス
//---------------------------------------------------------------------------
#include "ImageBuffer.h"

std::unordered_map<std::string, int> ImageBuffer::image_buffer_ = {};    // 画像ハンドルのバッファを初期化
                                                                         //---------------------------------------------------------------------------------
//!	初期化
//---------------------------------------------------------------------------------
void ImageBuffer::Init()
{
    image_buffer_.clear();                                                     // 画像ハンドルのバッファをクリア
    image_buffer_["test"] = DxLib::LoadGraph("data/PoyPoy/Image/test.png");    // テスト画像
}

//---------------------------------------------------------------------------------
//!	終了処理
//---------------------------------------------------------------------------------
void ImageBuffer::Exit()
{
    // 画像ハンドルを解放
    for(auto it = image_buffer_.begin(); it != image_buffer_.end(); ++it) {
        if(it->second != -1) {
            DxLib::DeleteGraph(it->second);    // 画像ハンドルを解放
            it->second = -1;                   // ハンドルを無効化
        }
    }
}

//---------------------------------------------------------------------------------
//!	画像ハンドルを取得する関数
//---------------------------------------------------------------------------------
int ImageBuffer::GetImageHandle(const std::string& image_key)
{
    return image_buffer_[image_key];    // 画像ハンドルを返す
}
